<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
<h2>환영합니다 ! </h2><br>
<h5>■ 간판(칸반)이란</h5><br>
간판(칸반)이란 생산시스템의 생산흐름을 통제하기 위하여 사용되는 마분지 카드를 의미한다. 여기에는 부품에 대한 정보가 기록된다. <br>
칸반시스템은 특히 도요다 자동차의 생산시스템에서 유래된 용어로서 JIT(Just in Time) 시스템의 생산통제수단이다. 낭비를 제거하고 필요한 때에 필요한 물건을 필요한 양만큼만 만들어서<br>
 보다 빨리, 보다 싸게 생산하기 위한 목적으로 활용된다. 간판의 주요 이점은 소프트웨어 품질에 초점을 맞출수 있게 해주는 것이다. <br>
 스크럼에서는, 스프린트 내에 있는 것을 하기 위하여 코드리뷰를 건너뛰고, 코드 커버리지 표준인 95%에 못미치는 70%를 승인하는 등 기술적 부채를 늘려가는 경우가 많았다. <br>
Stormpath는 코드 품질을 매우 중요하게 생각했기 때문에, 이렇게 지속되는 리스크는 모두를 불편하게 했다.<br>
간판에서는, 코드 품질 보증 단계는 프로세스에 포함된다. 우리는 거의 데드라인이 없기 때문에, 이런 단계를 건너 뛰어야 할 만한 압박이 없다 . <br>
사실상, 기술 조직이 프로세스를 소유하기 때문에, 프로세스에 전념하게 하는 강한 압박이 있다. 개발자들은 100%의 코드 리뷰와 95%가 넘는 코드 커버리지를 만들기 위해 분투할 것이다.<br>
간판의 힘은 진행 하는 일의 제한을 두어 더 적은 아이템을 더 빨리 만들어 내는 것에 집중하는 것에서 나온다. 다른 모든 것들 처럼, 그것은 완벽하지 않고, 모든 상황에서, 모두를 위해 완벽히 적합하지 않을 수는 있다. <br>
하지만 우리는 결국 행복한 팀, 더 높은 생산성, 사업과 기술조직 간의 더 적은 긴장감, 더 높은 소프트웨어 품질, 그리고 더 훨씬 적은 오버헤드를 얻었다.이겼다!
<br><br>
<h5>■ 간판 사용</h5><br>
•작업 흐름을 시각화하라<br>
•일을 작은 조각으로 나누고, 카드에 각 항목을 기입한 후 벽에 붙인다<br>
•이름이 부여된 열을 사용하여 각 항목이 작업 흐름의 어디에 있는지 표시한다<br>
•WIP(작업 중인 일) 개수를 제한하라. 각 작업 흐름 상태(단계)별로 작업 중인 항목을 얼마나 허용할 것인지 확실한 수치를 부여한다<br>
•리드 타임(한 항목을 완료하는 데 소요되는 평균 시간)을 측정하고, 리드 타임을 가능한 한 짧고 예측 가능하게 만들 수 있도록 프로세스를 최적화한다
</body>
</html>